app/Config/Services.php

     public static function user($getShared = true){
        if($getShared){
            return static::getSharedInstance('user');
        }
        $usersModel = new \App\Models\UsersModel();

        return $usersModel->find(session()->get('loggedUser'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '7'