app/Controllers/Backend/Dashboard.php

    public function index(){

       // $param1 = $this->request->uri->getSegment(2);
       // $param2 = $this->request->uri->getSegment(3);

       $model = new \App\Models\HomeSettingModel();
       $data = $model->orderBy("sira","asc")->findAll();

       $menuModel = new \App\Models\MenuModel();

       $menus = $menuModel->where('parent',0)->orderBy("sira","asc")->findAll();

       foreach($menus as &$menu){
            $menu['children'] = $menuModel->where("parent",$menu['id'])->orderBy("sira","asc")->findAll();
---
SELECT *
FROM `home_setting`
ORDER BY `sira` ASC
SELECT *
FROM `menu`
WHERE `parent` = 0
ORDER BY `sira` ASC
SELECT *
FROM `menu`
WHERE `parent` = '1'
ORDER BY `sira` ASC