app/Controllers/Backend/Settings.php

    public function public_settings(){


        $settingsModel = model('SettingsModel');

        $settings = $settingsModel->find(1);
---
SELECT *
FROM `settings`
WHERE `settings`.`id` = 1

    public function public_settings_post(){

        $settingsModel = model('SettingsModel');

        $find = $settingsModel->find(1);
---
SELECT *
FROM `settings`
WHERE `settings`.`id` = 1




        if($settingsModel->save($find)){
---
UPDATE `settings` SET `title` = 'SmurfWeb Anaokulu Scripti', `logo` = 'logo.png', `favicon` = 'favicon1.png', `active` = 1, `preloader` = 1, `facebook` = 'facebook.com', `instagram` = 'instagram.com', `youtube` = '', `twitter` = 'twitter.com', `seo_author` = '', `seo_description` = 'SmurfWeb Anaokulu olarak okulumuzda çalışan tüm öğretmenleri yoğun bir merkezi eğitimle yeni döneme hazırlıyoruz. Sene içerisinde de destek eğitimlerimize devam ediyoruz.', `seo_keywords` = '', `telephone` = '0(123) 000 00 10', `email` = 'anaokulu@smurfweb.com', `adress` = 'Demirtaş Mah. 16245 Osmangazi/Bursa', `html_head` = '', `html_css` = '', `html_js` = '', `html_body` = '', `footer` = 'Copyright © 2022 Tüm Hakları Saklıdır. SmurfWeb'
WHERE `settings`.`id` IN ('1')

    public function ultra_settings(){

        $settingsModel = model('SettingsModel');

        $find = $settingsModel->find(1);
---
SELECT *
FROM `settings`
WHERE `settings`.`id` = 1

    public function mail_setting(){
        $emailModel = model('EmailsModel');

        $data = $emailModel->find(1);
---
SELECT *
FROM `emails`
WHERE `emails`.`id` = 1

    public function mail_setting_post(){

        $emailModel = model('EmailsModel');

        $find = $emailModel->find(1);

        if(!$find){
            return redirect()->back()->with('fail',"Teknik bir sorun oluştu.");
        }

        $find['host'] = $this->request->getPost('host');
        $find['port'] = $this->request->getPost('port');
        $find['email'] = $this->request->getPost('email');
        $find['password'] = $this->request->getPost('password');
        $find['secure'] = $this->request->getPost('secure');
        $find['replyMail'] = $this->request->getPost('replyMail');

        if($emailModel->save($find)){
---
SELECT *
FROM `emails`
WHERE `emails`.`id` = 1
UPDATE `emails` SET `host` = '', `port` = '425', `email` = '', `password` = '', `secure` = 'tls', `replyMail` = ''
WHERE `emails`.`id` IN ('1')