app/Controllers/LoggedController.php

SELECT COUNT(*) AS `numrows`
FROM `contacts`
WHERE `isRead` = 0
SELECT *
FROM `contacts`
ORDER BY `isRead` ASC, `created_at` DESC
 LIMIT 3
---
    public function __construct(){

        $view = \Config\Services::renderer();

        $user = service('user');

        $contacts = new \App\Models\ContactsModel();

        $count = $contacts->where("isRead",0)->countAllResults();

        $data = $contacts->orderBy("isRead","asc")->orderBy('created_at','desc')->limit(3)->get()->getResult('array');