app/Libraries/Setting.php

    public function __construct(){
        $settingsModel = new \App\Models\SettingsModel();

        $this->data = $settingsModel->find(1);
---
SELECT *
FROM `settings`
WHERE `settings`.`id` = 1

    public function getMenus(){
        if($this->menus) return $this->menus;

        $menuModel = new \App\Models\MenuModel();

        $menus = $menuModel->where('parent',0)->orderBy("sira","asc")->findAll();

        foreach($menus as &$menu){
             $menu['children'] = $menuModel->where("parent",$menu['id'])->orderBy("sira","asc")->findAll();
---
SELECT *
FROM `menu`
WHERE `parent` = 0
ORDER BY `sira` ASC
SELECT *
FROM `menu`
WHERE `parent` = '1'
ORDER BY `sira` ASC

    private function _setMenu($menu){
        switch($menu){
            case 'Hizmetler':
                $ServicesModel = new \App\Models\ServicesModel();
                $data = $ServicesModel->where("publish",1)->orderBy("created_at","desc")->limit(5)->get()->getResult('array');

                $this->services = $data;

                $yeni = array();
                foreach($data as $item){
                    $yeni[] = [
                        "to" => "/hizmetlerimiz/".$item['slug'] ,
                        "name" => $item['title']
                    ];
                }
                $yeni[] = [
                    "to" => "/hizmetlerimiz",
                    "name" => "Tümünü Görüntüle"
                ];
                return $yeni;
            break;
            case 'Etkinlikler':
                $EventsModel = new \App\Models\EventsModel();
                $data = $EventsModel->where("publish",1)->orderBy("created_at","desc")->limit(5)->get()->getResult('array');
---
SELECT *
FROM `services`
WHERE `publish` = 1
ORDER BY `created_at` DESC
 LIMIT 5
SELECT *
FROM `events`
WHERE `publish` = 1
ORDER BY `created_at` DESC
 LIMIT 5